# Задача 14: Требуется вывести все целые степени двойки (т.е. числа 
# вида 2^k), не превосходящие числа N.

# 10 -> 1 2 4 8

N = int(input('Введите число N '))
a = 0
b = 2
for i in range(N):
    if a != 1:
        b = b ** i
        if b <= N:
            print(b)
            b = 2
        else:
            a = 1
    else:
        i = N
        